In [58]:
import pandas as pd
import numpy as np

In [59]:
mylist = [5.4, 6.1, 1.7, 99.8]
myarray = np.array(mylist)

In [60]:
myseries1 = pd.Series(data=mylist)
print(myseries1)
myseries2 = pd.Series(data=myarray)
print(myseries2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [61]:
print(myseries1[2])

1.7

In [62]:
mylabels = ['first', 'second', 'third', 'fourth']
myseries3 = pd.Series(data=mylist, index=mylabels)
print(myseries3)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [63]:
myseries4 = pd.Series(mylist, mylabels)
print(myseries4)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [64]:
print(myseries4['second'])

6.1

In [65]:
myseries5 = pd.Series([5.5, 1.1, 8.8, 1.6], ['first', 'second', 'third', 'fourth'])
print(myseries5)
print('')
print(myseries5+myseries4)

first     5.5
second    1.1
third     8.8
fourth    1.6
dtype: float64

first      10.9
second      7.2
third      10.5
fourth    101.4
dtype: float64

In [66]:
df1 = pd.concat([myseries4,myseries5], axis=1, sort=False)
df1

           0    1
first    5.4  5.5
second   6.1  1.1
third    1.7  8.8
fourth  99.8  1.6

In [67]:
df2 = pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0 -0.147943 -0.180650 -0.577274 -0.380627  1.126221
1  0.182329  0.438035 -0.811858  0.946115 -1.691349
2 -0.373611 -1.232014  0.535532  1.322828 -0.519467
3  1.634180 -0.134144 -1.203259  1.119370  0.147938
4 -1.757303  1.535594 -1.174196  1.415901 -0.617937

In [68]:
df3 = pd.DataFrame(np.random.randn(5,5), index=['row 1', 'row 2', 'row 3', 'row 4', 'row 5'],
                  columns=['col 1', 'col 2', 'col 3', 'col 4', 'col 5'])
df3

          col 1     col 2     col 3     col 4     col 5
row 1  0.354371  0.399701 -0.796687  1.053961  1.539519
row 2 -0.047540 -1.029300 -0.490623  0.127849 -0.175412
row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284
row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558
row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705

In [69]:
print(df3['col 2'])
print('')
df3[['col 3', 'col 1']]

row 1    0.399701
row 2   -1.029300
row 3   -2.198375
row 4    1.013015
row 5    2.972361
Name: col 2, dtype: float64

          col 3     col 1
row 1 -0.796687  0.354371
row 2 -0.490623 -0.047540
row 3 -0.225581  0.317791
row 4  0.138625  0.244143
row 5 -0.382829  1.433036

In [70]:
df3.loc['row 4']

col 1    0.244143
col 2    1.013015
col 3    0.138625
col 4   -0.049078
col 5   -0.438558
Name: row 4, dtype: float64

In [71]:
df3.iloc[2]

col 1    0.317791
col 2   -2.198375
col 3   -0.225581
col 4    1.983471
col 5   -0.188284
Name: row 3, dtype: float64

In [72]:
df3.loc[['row 4', 'row 1'], ['col 2', 'col 3']]

          col 2     col 3
row 4  1.013015  0.138625
row 1  0.399701 -0.796687

In [73]:
df3>0

       col 1  col 2  col 3  col 4  col 5
row 1   True   True  False   True   True
row 2  False  False  False   True  False
row 3   True  False  False   True  False
row 4   True   True   True  False  False
row 5   True   True  False  False  False

In [74]:
print(df3[df3>0])

          col 1     col 2     col 3     col 4     col 5
row 1  0.354371  0.399701       NaN  1.053961  1.539519
row 2       NaN       NaN       NaN  0.127849       NaN
row 3  0.317791       NaN       NaN  1.983471       NaN
row 4  0.244143  1.013015  0.138625       NaN       NaN
row 5  1.433036  2.972361       NaN       NaN       NaN

In [75]:
df3['col 6'] = np.random.randn(5,1)
df3

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076
row 2 -0.047540 -1.029300 -0.490623  0.127849 -0.175412 -0.281362
row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216
row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486
row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [76]:
df3.drop('col 1', axis=1)

          col 2     col 3     col 4     col 5     col 6
row 1  0.399701 -0.796687  1.053961  1.539519 -0.811076
row 2 -1.029300 -0.490623  0.127849 -0.175412 -0.281362
row 3 -2.198375 -0.225581  1.983471 -0.188284  0.495216
row 4  1.013015  0.138625 -0.049078 -0.438558 -2.641486
row 5  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [77]:
df3

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076
row 2 -0.047540 -1.029300 -0.490623  0.127849 -0.175412 -0.281362
row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216
row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486
row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [78]:
df4 = df3.drop('col 1', axis=1)
df4

          col 2     col 3     col 4     col 5     col 6
row 1  0.399701 -0.796687  1.053961  1.539519 -0.811076
row 2 -1.029300 -0.490623  0.127849 -0.175412 -0.281362
row 3 -2.198375 -0.225581  1.983471 -0.188284  0.495216
row 4  1.013015  0.138625 -0.049078 -0.438558 -2.641486
row 5  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [79]:
df5 = df3.drop('row 2', axis=0)
df5

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076
row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216
row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486
row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [80]:
df5.reset_index()

   index     col 1     col 2     col 3     col 4     col 5     col 6
0  row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076
1  row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216
2  row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486
3  row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [81]:
df5

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076
row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216
row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486
row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [83]:
df5.reset_index(inplace=True)
df5

   index     col 1     col 2     col 3     col 4     col 5     col 6
0  row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076
1  row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216
2  row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486
3  row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [85]:
df5['new name'] = ['This', 'is', 'the', 'row']
df5

   index     col 1     col 2     col 3     col 4     col 5     col 6 new name
0  row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076     This
1  row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216       is
2  row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486      the
3  row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899      row

In [86]:
df5.set_index('new name', inplace=True)
df5

          index     col 1     col 2     col 3     col 4     col 5     col 6
new name
This      row 1  0.354371  0.399701 -0.796687  1.053961  1.539519 -0.811076
is        row 3  0.317791 -2.198375 -0.225581  1.983471 -0.188284  0.495216
the       row 4  0.244143  1.013015  0.138625 -0.049078 -0.438558 -2.641486
row       row 5  1.433036  2.972361 -0.382829 -1.099835 -0.849705  0.043899

In [87]:
df5.mean()

col 1    0.587335
col 2    0.546676
col 3   -0.316618
col 4    0.472130
col 5    0.015743
col 6   -0.728361
dtype: float64